imbluedabr/m33mu/cpu/mcxn947/mcxn947_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */
#include <string.h>
#include <stdio.h>
#include "mcxn947/mcxn947_mmio.h"
#include "m33mu/memmap.h"
#include "m33mu/mmio.h"
#include "m33mu/gpio.h"
#include "m33mu/nvic.h"

#define SYSCON_BASE 0x40000000u
#define SYSCON_SEC_BASE (SYSCON_BASE + 0x10000000u)
#define SYSCON_SIZE 0x1000u

#define GPIO0_BASE 0x40096000u
#define GPIO1_BASE 0x40097000u
#define GPIO2_BASE 0x40098000u
#define GPIO3_BASE 0x40099000u
#define GPIO4_BASE 0x4009A000u
#define GPIO5_BASE 0x4009B000u
#define GPIO_SIZE  0x128u

#define GPIO_PDOR 0x20u
#define GPIO_PSOR 0x24u
#define GPIO_PCOR 0x28u
#define GPIO_PTOR 0x2Cu
#define GPIO_PDIR 0x30u
#define GPIO_PDDR 0x34u
#define GPIO_PIDR 0x38u
#define GPIO_ISFR0 0x100u
#define GPIO_ISFR1 0x104u

#define PORT0_BASE 0x40116000u
#define PORT1_BASE 0x40117000u
#define PORT2_BASE 0x40118000u
#define PORT3_BASE 0x40119000u
#define PORT4_BASE 0x4011A000u
#define PORT5_BASE 0x4011B000u
#define PORT_SIZE  0x100u

#define PORT_PCR_BASE 0x20u
#define PORT_PCR_COUNT 32
#define PORT_GPCLR 0xC0u
#define PORT_GPCHR 0xC4u
#define PORT_ISFR0 0xE0u
#define PORT_ISFR1 0xE4u
#define PORT_DFER0 0xF0u
#define PORT_DIER0 0xF8u

#define PORT_PCR_MUX_SHIFT 8
#define PORT_PCR_MUX_MASK (0xFu << PORT_PCR_MUX_SHIFT)

#define TRDC_BASE 0x400C7000u
#define TRDC_SEC_BASE 0x500C7000u
#define TRDC_SIZE 0x1CCu

#define TRDC_MBC0_MEM0_GLBCFG 0x00u
#define TRDC_MBC0_MEM1_GLBCFG 0x04u
#define TRDC_MBC0_MEM2_GLBCFG 0x08u
#define TRDC_MBC0_MEM3_GLBCFG 0x0Cu
#define TRDC_MBC0_NSE_BLK_INDEX 0x10u
#define TRDC_MBC0_NSE_BLK_SET 0x14u
#define TRDC_MBC0_NSE_BLK_CLR 0x18u
#define TRDC_MBC0_NSE_BLK_CLR_ALL 0x1Cu
#define TRDC_MBC0_MEMN_GLBAC0 0x20u
#define TRDC_MBC0_MEMN_GLBAC7 0x3Cu

#define TRDC_NSE_WNDX_SHIFT 2u
#define TRDC_NSE_WNDX_MASK (0xFu << TRDC_NSE_WNDX_SHIFT)
#define TRDC_NSE_MEM_SEL_SHIFT 8u
#define TRDC_NSE_MEM_SEL_MASK (0xFu << TRDC_NSE_MEM_SEL_SHIFT)
#define TRDC_NSE_DID_SEL0 (1u << 16)
#define TRDC_NSE_AI (1u << 31)

/* SYSCON register offsets */
#define SYSCON_PRESETCTRL0 0x100u
#define SYSCON_AHBCLKCTRL0 0x200u
#define SYSCON_AHBCLKCTRL1 0x204u

struct gpio_bank {
    mm_u32 regs[GPIO_SIZE / 4];
};

struct syscon_state {
    mm_u32 regs[SYSCON_SIZE / 4];
};

struct port_state {
    mm_u32 regs[PORT_SIZE / 4];
    mm_u32 pcr[PORT_PCR_COUNT];
    mm_u32 last_pdir;
};

struct trdc_state {
    mm_u32 regs[TRDC_SIZE / 4u];
    mm_u32 nse_words[4][2];
};

static struct gpio_bank gpio_banks[6];
static struct syscon_state syscon;
static struct port_state ports[6];
static struct trdc_state trdc;
static struct mm_nvic *g_gpio_nvic = 0;

static int port_index_for_bank(int bank)
{
    if (bank >= 0 && bank < 6) return bank;
    return -1;
}

void mm_mcxn947_gpio_set_nvic(struct mm_nvic *nvic)
{
    g_gpio_nvic = nvic;
}

static mm_bool gpio_bank_enabled(int bank)
{
    mm_u32 reg;
    if (bank < 0 || bank >= 6) return MM_FALSE;

    /* GPIO0 clock is at bit 19 of AHBCLKCTRL0 */
    reg = syscon.regs[SYSCON_AHBCLKCTRL0 / 4];
    if (!((reg >> (19 + bank)) & 1u)) return MM_FALSE;

    /* GPIO0 reset is at bit 19 of PRESETCTRL0 */
    reg = syscon.regs[SYSCON_PRESETCTRL0 / 4];
    return ((reg >> (19 + bank)) & 1u) ? MM_TRUE : MM_FALSE;
}

static void gpio_raise_irq(int bank)
{
    mm_u32 isfr0, isfr1;
    int irq0 = -1;
    int irq1 = -1;

    if (g_gpio_nvic == 0) return;
    if (bank < 0 || bank >= 6) return;

    isfr0 = gpio_banks[bank].regs[GPIO_ISFR0 / 4];
    isfr1 = gpio_banks[bank].regs[GPIO_ISFR1 / 4];

    switch (bank) {
    case 0: irq0 = 17; irq1 = 18; break;
    case 1: irq0 = 19; irq1 = 20; break;
    case 2: irq0 = 21; irq1 = 22; break;
    case 3: irq0 = 23; irq1 = 24; break;
    case 4: irq0 = 25; irq1 = 26; break;
    case 5: irq0 = 27; irq1 = 28; break;
    default: break;
    }

    if (irq0 >= 0) {
        mm_nvic_set_pending(g_gpio_nvic, (mm_u32)irq0, (isfr0 != 0u) ? MM_TRUE : MM_FALSE);
    }
    if (irq1 >= 0) {
        mm_nvic_set_pending(g_gpio_nvic, (mm_u32)irq1, (isfr1 != 0u) ? MM_TRUE : MM_FALSE);
    }
}

static void gpio_update_edges(int bank, mm_u32 old_pdir, mm_u32 new_pdir)
{
    mm_u32 delta = old_pdir ^ new_pdir;
    int port_idx = port_index_for_bank(bank);
    if (delta == 0u) return;
    if (bank < 0 || bank >= 6) return;
    if (port_idx >= 0) {
        mm_u32 dier0 = ports[port_idx].regs[PORT_DIER0 / 4];
        mm_u32 fired = delta & dier0;
        if (fired != 0u) {
            ports[port_idx].regs[PORT_ISFR0 / 4] |= fired;
            gpio_banks[bank].regs[GPIO_ISFR0 / 4] |= fired;
            gpio_raise_irq(bank);
        }
    } else {
        gpio_banks[bank].regs[GPIO_ISFR0 / 4] |= delta;
        gpio_raise_irq(bank);
    }
}

static mm_bool gpio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct gpio_bank *g = (struct gpio_bank *)opaque;
    int bank = (int)(g - gpio_banks);
    if (g == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (!gpio_bank_enabled(bank)) return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)g->regs + offset, size_bytes);
    return MM_TRUE;
}

static void gpio_sync_pdir(struct gpio_bank *g)
{
    if (g == 0) return;
    g->regs[GPIO_PDIR / 4] = g->regs[GPIO_PDOR / 4];
}

static mm_bool gpio_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct gpio_bank *g = (struct gpio_bank *)opaque;
    int bank = (int)(g - gpio_banks);
    mm_u32 old_pdir;
    if (g == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (!gpio_bank_enabled(bank)) return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE) return MM_FALSE;

    if (offset == GPIO_ISFR0 && size_bytes == 4) {
        g->regs[GPIO_ISFR0 / 4] &= ~value;
        gpio_raise_irq(bank);
        return MM_TRUE;
    }
    if (offset == GPIO_ISFR1 && size_bytes == 4) {
        g->regs[GPIO_ISFR1 / 4] &= ~value;
        gpio_raise_irq(bank);
        return MM_TRUE;
    }

