imbluedabr/m33mu/cpu/mcxn947/mcxn947_mmio.c
    old_pdir = g->regs[GPIO_PDIR / 4];
    if (offset == GPIO_PDOR && size_bytes == 4) {
        g->regs[GPIO_PDOR / 4] = value;
        gpio_sync_pdir(g);
        gpio_update_edges(bank, old_pdir, g->regs[GPIO_PDIR / 4]);
        return MM_TRUE;
    }
    if (offset == GPIO_PSOR && size_bytes == 4) {
        g->regs[GPIO_PDOR / 4] |= value;
        gpio_sync_pdir(g);
        gpio_update_edges(bank, old_pdir, g->regs[GPIO_PDIR / 4]);
        return MM_TRUE;
    }
    if (offset == GPIO_PCOR && size_bytes == 4) {
        g->regs[GPIO_PDOR / 4] &= ~value;
        gpio_sync_pdir(g);
        gpio_update_edges(bank, old_pdir, g->regs[GPIO_PDIR / 4]);
        return MM_TRUE;
    }
    if (offset == GPIO_PTOR && size_bytes == 4) {
        g->regs[GPIO_PDOR / 4] ^= value;
        gpio_sync_pdir(g);
        gpio_update_edges(bank, old_pdir, g->regs[GPIO_PDIR / 4]);
        return MM_TRUE;
    }
    if (offset == GPIO_PDDR && size_bytes == 4) {
        g->regs[GPIO_PDDR / 4] = value;
        gpio_update_edges(bank, old_pdir, g->regs[GPIO_PDIR / 4]);
        return MM_TRUE;
    }

    memcpy((mm_u8 *)g->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_bool port_enabled(int idx)
{
    mm_u32 reg;
    if (idx < 0 || idx >= 6) return MM_FALSE;

    /* PORT0 clock is at bit 13 of AHBCLKCTRL0 */
    reg = syscon.regs[SYSCON_AHBCLKCTRL0 / 4];
    if (!((reg >> (13 + idx)) & 1u)) return MM_FALSE;

    /* PORT0 reset is at bit 13 of PRESETCTRL0 */
    reg = syscon.regs[SYSCON_PRESETCTRL0 / 4];
    return ((reg >> (13 + idx)) & 1u) ? MM_TRUE : MM_FALSE;
}

static mm_bool port_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct port_state *p = (struct port_state *)opaque;
    int idx = (int)(p - ports);
    if (p == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (!port_enabled(idx)) return MM_FALSE;
    if ((offset + size_bytes) > PORT_SIZE) return MM_FALSE;

    if (size_bytes == 4 && offset >= PORT_PCR_BASE && offset < (PORT_PCR_BASE + PORT_PCR_COUNT * 4)) {
        int pin = (int)((offset - PORT_PCR_BASE) / 4);
        if (pin >= 0 && pin < PORT_PCR_COUNT) {
            *value_out = p->pcr[pin];
            return MM_TRUE;
        }
    }

    memcpy(value_out, (mm_u8 *)p->regs + offset, size_bytes);
    return MM_TRUE;
}

static void port_write_pcr(struct port_state *p, int pin, mm_u32 value)
{
    if (pin < 0 || pin >= PORT_PCR_COUNT) return;
    p->pcr[pin] = value;
}

static mm_bool port_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct port_state *p = (struct port_state *)opaque;
    int idx = (int)(p - ports);
    if (p == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if (!port_enabled(idx)) return MM_FALSE;
    if ((offset + size_bytes) > PORT_SIZE) return MM_FALSE;

    if (size_bytes == 4) {
        if (offset >= PORT_PCR_BASE && offset < (PORT_PCR_BASE + PORT_PCR_COUNT * 4)) {
            int pin = (int)((offset - PORT_PCR_BASE) / 4);
            if (pin >= 0 && pin < PORT_PCR_COUNT) {
                port_write_pcr(p, pin, value);
                return MM_TRUE;
            }
        }
        if (offset == PORT_GPCLR) {
            mm_u32 gpwe = value & 0xFFFFu;
            mm_u32 gpwd = (value >> 16) & 0xFFFFu;
            int pin;
            for (pin = 0; pin < 16; ++pin) {
                if ((gpwe >> pin) & 1u) {
                    port_write_pcr(p, pin, (p->pcr[pin] & 0xFFFF0000u) | gpwd);
                }
            }
            return MM_TRUE;
        }
        if (offset == PORT_GPCHR) {
            mm_u32 gpwe = value & 0xFFFFu;
            mm_u32 gpwd = (value >> 16) & 0xFFFFu;
            int pin;
            for (pin = 0; pin < 16; ++pin) {
                if ((gpwe >> pin) & 1u) {
                    int idx_pin = 16 + pin;
                    port_write_pcr(p, idx_pin, (p->pcr[idx_pin] & 0xFFFF0000u) | gpwd);
                }
            }
            return MM_TRUE;
        }
        if (offset == PORT_ISFR0) {
            p->regs[PORT_ISFR0 / 4] &= ~value;
            return MM_TRUE;
        }
        if (offset == PORT_ISFR1) {
            p->regs[PORT_ISFR1 / 4] &= ~value;
            return MM_TRUE;
        }
    }
    memcpy((mm_u8 *)p->regs + offset, &value, size_bytes);
    return MM_TRUE;
}

static mm_u32 mcxn947_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= 6) return 0;
    return gpio_banks[bank].regs[GPIO_PDOR / 4];
}

static mm_u32 mcxn947_gpio_bank_read_moder(void *opaque, int bank)
{
    mm_u32 moder = 0;
    mm_u32 pddr;
    int pin;
    int port_idx;
    (void)opaque;
    if (bank < 0 || bank >= 6) return 0;
    pddr = gpio_banks[bank].regs[GPIO_PDDR / 4];
    port_idx = port_index_for_bank(bank);
    for (pin = 0; pin < 16; ++pin) {
        mm_u32 mux = 0;
        if (port_idx >= 0) {
            mux = (ports[port_idx].pcr[pin] & PORT_PCR_MUX_MASK) >> PORT_PCR_MUX_SHIFT;
        }
        if (mux == 0u) {
            /* Disabled */
        } else if (mux == 1u) {
            if ((pddr >> pin) & 1u) {
                moder |= (1u << (pin * 2));
            }
        } else {
            moder |= (2u << (pin * 2)); /* peripheral */
        }
    }
    return moder;
}

static mm_bool mcxn947_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    return gpio_bank_enabled(bank);
}

static mm_u32 mcxn947_gpio_bank_read_seccfgr(void *opaque, int bank)
{
    (void)opaque;
    (void)bank;
    return 0;
}

static mm_bool mcxn947_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    static const int pin_counts[] = { 32, 32, 32, 32, 32, 32 };
    (void)opaque;
    if (bank < 0 || bank >= 6) {
        return MM_FALSE;
    }
    if (name_out != 0 && name_len > 0u) {
        name_out[0] = (char)('0' + bank);
        if (name_len > 1u) {
            name_out[1] = '\0';
        }
    }
    if (pins_out != 0) {
        *pins_out = pin_counts[bank];
    }
    return MM_TRUE;
}

struct syscon_clk_name {
    const char *name;
    mm_u32 reg_offset;
    mm_u32 bit;
};

static const struct syscon_clk_name syscon_clk_names[] = {
    { "FC0", SYSCON_AHBCLKCTRL0, 11 },
    { "FC1", SYSCON_AHBCLKCTRL0, 12 },
    { "PORT0", SYSCON_AHBCLKCTRL0, 13 },
    { "PORT1", SYSCON_AHBCLKCTRL0, 14 },
    { "PORT2", SYSCON_AHBCLKCTRL0, 15 },
    { "PORT3", SYSCON_AHBCLKCTRL0, 16 },
    { "PORT4", SYSCON_AHBCLKCTRL0, 17 },
    { "PORT5", SYSCON_AHBCLKCTRL0, 18 },
    { "GPIO0", SYSCON_AHBCLKCTRL0, 19 },
    { "GPIO1", SYSCON_AHBCLKCTRL0, 20 },
    { "GPIO2", SYSCON_AHBCLKCTRL0, 21 },
    { "GPIO3", SYSCON_AHBCLKCTRL0, 22 },
    { "GPIO4", SYSCON_AHBCLKCTRL0, 23 },
    { "GPIO5", SYSCON_AHBCLKCTRL0, 24 }
};

