imbluedabr/m33mu/cpu/mcxn947/mcxn947_mmio.c
static mm_bool mcxn947_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len)
{
    char buf[256];
    size_t pos = 0;
    size_t i;
    mm_bool have = MM_FALSE;
    (void)opaque;
    if (out == 0 || out_len == 0u) {
        return MM_FALSE;
    }
    if (line != 0) {
        return MM_FALSE;
    }
    pos += snprintf(buf + pos, sizeof(buf) - pos, "SYSCON:");
    for (i = 0; i < sizeof(syscon_clk_names) / sizeof(syscon_clk_names[0]); ++i) {
        mm_u32 reg = syscon.regs[syscon_clk_names[i].reg_offset / 4];
        if (!((reg >> syscon_clk_names[i].bit) & 1u)) {
            continue;
        }
        if (pos + 2u < sizeof(buf)) {
            pos += snprintf(buf + pos, sizeof(buf) - pos, " %s", syscon_clk_names[i].name);
            have = MM_TRUE;
        }
    }
    if (!have) {
        return MM_FALSE;
    }
    snprintf(out, out_len, "%s", buf);
    return MM_TRUE;
}

static mm_u32 trdc_mem_nblks(int mem)
{
    mm_u32 glbcfg;
    if (mem < 0 || mem > 3) return 0u;
    glbcfg = trdc.regs[(TRDC_MBC0_MEM0_GLBCFG / 4u) + (mm_u32)mem];
    return glbcfg & 0x3FFu;
}

static mm_u32 trdc_mem_words(int mem)
{
    mm_u32 nblks = trdc_mem_nblks(mem);
    return (nblks + 31u) / 32u;
}

static void trdc_nse_apply(mm_u32 value, mm_bool set_bits)
{
    mm_u32 index = trdc.regs[TRDC_MBC0_NSE_BLK_INDEX / 4u];
    mm_u32 mem_sel = (index & TRDC_NSE_MEM_SEL_MASK) >> TRDC_NSE_MEM_SEL_SHIFT;
    mm_u32 wndx = (index & TRDC_NSE_WNDX_MASK) >> TRDC_NSE_WNDX_SHIFT;
    mm_u32 word_count;
    if ((index & TRDC_NSE_DID_SEL0) == 0u) return;
    if (mem_sel >= 4u) return;
    word_count = trdc_mem_words((int)mem_sel);
    if (wndx >= word_count) return;
    if (set_bits) {
        trdc.nse_words[mem_sel][wndx] |= value;
    } else {
        trdc.nse_words[mem_sel][wndx] &= ~value;
    }
    if ((index & TRDC_NSE_AI) != 0u) {
        mm_u32 next = (wndx + 1u) & 0xFu;
        index &= ~TRDC_NSE_WNDX_MASK;
        index |= (next << TRDC_NSE_WNDX_SHIFT) & TRDC_NSE_WNDX_MASK;
        trdc.regs[TRDC_MBC0_NSE_BLK_INDEX / 4u] = index;
    }
}

static mm_bool trdc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct trdc_state *t = (struct trdc_state *)opaque;
    if (t == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > TRDC_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)t->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool trdc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct trdc_state *t = (struct trdc_state *)opaque;
    mm_u32 reg_index;
    if (t == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > TRDC_SIZE) return MM_FALSE;
    if (size_bytes != 4) return MM_FALSE;

    reg_index = offset / 4u;
    if (offset == TRDC_MBC0_MEM0_GLBCFG || offset == TRDC_MBC0_MEM1_GLBCFG ||
        offset == TRDC_MBC0_MEM2_GLBCFG) {
        return MM_TRUE;
    }
    if (offset == TRDC_MBC0_MEM3_GLBCFG) {
        mm_u32 keep = t->regs[reg_index] & 0x3FFFFFFFu;
        t->regs[reg_index] = keep | (value & 0xC0000000u);
        return MM_TRUE;
    }
    if (offset == TRDC_MBC0_NSE_BLK_INDEX) {
        t->regs[reg_index] = value;
        return MM_TRUE;
    }
    if (offset == TRDC_MBC0_NSE_BLK_SET) {
        t->regs[reg_index] = value;
        trdc_nse_apply(value, MM_TRUE);
        return MM_TRUE;
    }
    if (offset == TRDC_MBC0_NSE_BLK_CLR) {
        t->regs[reg_index] = value;
        trdc_nse_apply(value, MM_FALSE);
        return MM_TRUE;
    }
    if (offset == TRDC_MBC0_NSE_BLK_CLR_ALL) {
        mm_u32 mem_sel = (value & TRDC_NSE_MEM_SEL_MASK) >> TRDC_NSE_MEM_SEL_SHIFT;
        t->regs[reg_index] = value;
        if ((value & TRDC_NSE_DID_SEL0) != 0u && mem_sel < 4u) {
            mm_u32 words = trdc_mem_words((int)mem_sel);
            mm_u32 i;
            for (i = 0; i < words; ++i) {
                trdc.nse_words[mem_sel][i] = 0u;
            }
        }
        return MM_TRUE;
    }
    if (offset >= TRDC_MBC0_MEMN_GLBAC0 && offset <= TRDC_MBC0_MEMN_GLBAC7) {
        mm_u32 current = t->regs[reg_index];
        if ((current & 0x80000000u) != 0u) {
            return MM_TRUE;
        }
        t->regs[reg_index] = value;
        return MM_TRUE;
    }

    t->regs[reg_index] = value;
    return MM_TRUE;
}

void mm_mcxn947_mmio_reset(void)
{
    memset(gpio_banks, 0, sizeof(gpio_banks));
    memset(&syscon, 0, sizeof(syscon));
    memset(ports, 0, sizeof(ports));
    memset(&trdc, 0, sizeof(trdc));
    g_gpio_nvic = 0;

    /* Initialize SYSCON reset states: clocks off (0), resets asserted (0) */
    /* Reset values from SVD: clocks start enabled */
    syscon.regs[SYSCON_AHBCLKCTRL0 / 4] = 0x00000603u; /* ROM, SRAM enabled by default */
    syscon.regs[SYSCON_PRESETCTRL0 / 4] = 0x00000000u; /* All resets asserted */

    trdc.regs[TRDC_MBC0_MEM0_GLBCFG / 4u] = 0x000F0040u;
    trdc.regs[TRDC_MBC0_MEM1_GLBCFG / 4u] = 0x000D0008u;
    trdc.regs[TRDC_MBC0_MEM2_GLBCFG / 4u] = 0x000C0004u;
    trdc.regs[TRDC_MBC0_MEM3_GLBCFG / 4u] = 0x00000000u;
    trdc.regs[TRDC_MBC0_MEMN_GLBAC0 / 4u] = 0x00006600u;
    trdc.regs[(TRDC_MBC0_MEMN_GLBAC0 / 4u) + 1u] = 0x80006600u;
    trdc.regs[(TRDC_MBC0_MEMN_GLBAC0 / 4u) + 2u] = 0x80005500u;
    trdc.regs[(TRDC_MBC0_MEMN_GLBAC0 / 4u) + 3u] = 0x80004400u;
    trdc.regs[(TRDC_MBC0_MEMN_GLBAC0 / 4u) + 4u] = 0x00005500u;
    trdc.regs[(TRDC_MBC0_MEMN_GLBAC0 / 4u) + 5u] = 0x00001100u;
    trdc.regs[(TRDC_MBC0_MEMN_GLBAC0 / 4u) + 6u] = 0x80001100u;
    trdc.regs[(TRDC_MBC0_MEMN_GLBAC0 / 4u) + 7u] = 0x80000000u;

    mm_gpio_bank_set_reader(mcxn947_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(mcxn947_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(mcxn947_gpio_bank_clock, 0);
    mm_gpio_bank_set_seccfgr_reader(mcxn947_gpio_bank_read_seccfgr, 0);
    mm_gpio_set_bank_info_reader(mcxn947_gpio_bank_info, 0);
    mm_rcc_set_clock_list_reader(mcxn947_rcc_clock_list_line, 0);
}

mm_bool mm_mcxn947_syscon_clock_on(mm_u32 reg_offset)
{
    mm_u32 reg;
    if (reg_offset >= SYSCON_SIZE) return MM_FALSE;
    reg = syscon.regs[reg_offset / 4];
    return (reg != 0u) ? MM_TRUE : MM_FALSE;
}

