imbluedabr/m33mu/cpu/mcxn947/mcxn947_mmio.c
mm_bool mm_mcxn947_syscon_reset_released(mm_u32 reg_offset)
{
    mm_u32 reg;
    if (reg_offset >= SYSCON_SIZE) return MM_FALSE;
    reg = syscon.regs[reg_offset / 4];
    return (reg != 0u) ? MM_TRUE : MM_FALSE;
}

static mm_bool syscon_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct syscon_state *s = (struct syscon_state *)opaque;
    if (s == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > SYSCON_SIZE) return MM_FALSE;
    memcpy(value_out, (mm_u8 *)s->regs + offset, size_bytes);
    return MM_TRUE;
}

static mm_bool syscon_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct syscon_state *s = (struct syscon_state *)opaque;
    if (s == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > SYSCON_SIZE) return MM_FALSE;
    if (size_bytes != 4) return MM_FALSE;
    s->regs[offset / 4] = value;
    return MM_TRUE;
}

mm_bool mm_mcxn947_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;
    if (bus == 0) return MM_FALSE;

    /* SYSCON */
    reg.base = SYSCON_BASE;
    reg.size = SYSCON_SIZE;
    reg.opaque = &syscon;
    reg.read = syscon_read;
    reg.write = syscon_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = SYSCON_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.size = GPIO_SIZE;
    reg.read = gpio_read;
    reg.write = gpio_write;

    /* GPIO0-5 */
    reg.base = GPIO0_BASE;
    reg.opaque = &gpio_banks[0];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO0_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO1_BASE;
    reg.opaque = &gpio_banks[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO1_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO2_BASE;
    reg.opaque = &gpio_banks[2];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO2_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO3_BASE;
    reg.opaque = &gpio_banks[3];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO3_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO4_BASE;
    reg.opaque = &gpio_banks[4];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO4_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO5_BASE;
    reg.opaque = &gpio_banks[5];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO5_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* PORT0-5 */
    reg.size = PORT_SIZE;
    reg.read = port_read;
    reg.write = port_write;

    reg.base = PORT0_BASE;
    reg.opaque = &ports[0];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORT0_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = PORT1_BASE;
    reg.opaque = &ports[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORT1_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = PORT2_BASE;
    reg.opaque = &ports[2];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORT2_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = PORT3_BASE;
    reg.opaque = &ports[3];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORT3_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = PORT4_BASE;
    reg.opaque = &ports[4];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORT4_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = PORT5_BASE;
    reg.opaque = &ports[5];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = PORT5_BASE + 0x10000000u;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* TRDC (MBC) */
    reg.base = TRDC_BASE;
    reg.size = TRDC_SIZE;
    reg.opaque = &trdc;
    reg.read = trdc_read;
    reg.write = trdc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = TRDC_SEC_BASE;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    return MM_TRUE;
}

void mm_mcxn947_flash_bind(struct mm_memmap *map,
                           mm_u8 *flash,
                           mm_u32 flash_size,
                           const struct mm_flash_persist *persist,
                           mm_u32 flags)
{
    (void)map;
    (void)flash;
    (void)flash_size;
    (void)persist;
    (void)flags;
}

mm_u64 mm_mcxn947_cpu_hz(void)
{
    return 150000000ull;
}

mm_bool mm_mcxn947_mpcbb_block_secure(int bank, mm_u32 block_index)
{
    mm_u32 word;
    mm_u32 bit;
    mm_u32 nblks;
    if (bank < 0 || bank >= 4) {
        return MM_FALSE;
    }
    nblks = trdc_mem_nblks(bank);
    if (block_index >= nblks) {
        return MM_FALSE;
    }
    word = block_index / 32u;
    bit = block_index % 32u;
    if (word >= 2u) {
        return MM_FALSE;
    }
    return ((trdc.nse_words[bank][word] >> bit) & 1u) == 0u;
}
